geva-elettronica/GEVINI/Arduino IDE V2/boards.txt
# Copyright (c) 2014-2017 Arduino LLC.  All right reserved.
#
# This library is free software; you can redistribute it and/or
# modify it under the terms of the GNU Lesser General Public
# License as published by the Free Software Foundation; either
# version 2.1 of the License, or (at your option) any later version.
#
# This library is distributed in the hope that it will be useful,
# but WITHOUT ANY WARRANTY; without even the implied warranty of
# MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.
# See the GNU Lesser General Public License for more details.
#
# You should have received a copy of the GNU Lesser General Public
# License along with this library; if not, write to the Free Software
# Foundation, Inc., 51 Franklin St, Fifth Floor, Boston, MA  02110-1301  USA

# GEVINO_SAM-BA_boot
# --------------------------------------
GEVINO_SAM-BA_boot.name=GEVINO SAMBA USB Boot
GEVINO_SAM-BA_boot.vid.0=0x2341
GEVINO_SAM-BA_boot.pid.0=0x804d
GEVINO_SAM-BA_boot.vid.1=0x2341
GEVINO_SAM-BA_boot.pid.1=0x004d
GEVINO_SAM-BA_boot.vid.2=0x2341
GEVINO_SAM-BA_boot.pid.2=0x824d
GEVINO_SAM-BA_boot.vid.3=0x2341
GEVINO_SAM-BA_boot.pid.3=0x024d
GEVINO_SAM-BA_boot.upload_port.0.vid=0x2341
GEVINO_SAM-BA_boot.upload_port.0.pid=0x804d
GEVINO_SAM-BA_boot.upload_port.1.vid=0x2341
GEVINO_SAM-BA_boot.upload_port.1.pid=0x004d
GEVINO_SAM-BA_boot.upload_port.2.vid=0x2341
GEVINO_SAM-BA_boot.upload_port.2.pid=0x824d
GEVINO_SAM-BA_boot.upload_port.3.vid=0x2341
GEVINO_SAM-BA_boot.upload_port.3.pid=0x024d
GEVINO_SAM-BA_boot.upload_port.4.board=GEVINO_SAM-BA_boot
GEVINO_SAM-BA_boot.upload.tool=bossac
GEVINO_SAM-BA_boot.upload.tool.default=bossac
GEVINO_SAM-BA_boot.upload.tool.network=arduino_ota
GEVINO_SAM-BA_boot.upload.protocol=sam-ba
GEVINO_SAM-BA_boot.upload.maximum_size=262144
GEVINO_SAM-BA_boot.upload.maximum_data_size=32768
GEVINO_SAM-BA_boot.upload.use_1200bps_touch=true
GEVINO_SAM-BA_boot.upload.wait_for_upload_port=true
GEVINO_SAM-BA_boot.upload.native_usb=true
GEVINO_SAM-BA_boot.build.mcu=cortex-m0plus
GEVINO_SAM-BA_boot.build.f_cpu=48000000L
GEVINO_SAM-BA_boot.build.usb_product="GEVINO"
GEVINO_SAM-BA_boot.build.usb_manufacturer="GEVA elettronica"
GEVINO_SAM-BA_boot.build.board=GEVINO
GEVINO_SAM-BA_boot.build.core=arduino
GEVINO_SAM-BA_boot.build.extra_flags=-D__SAMD21G18A__ {build.usb_flags}
GEVINO_SAM-BA_boot.build.ldscript=linker_scripts/gcc/flash_with_bootloader.ld
GEVINO_SAM-BA_boot.build.openocdscript=openocd_scripts/arduino_zero.cfg
GEVINO_SAM-BA_boot.build.variant=arduino_zero
GEVINO_SAM-BA_boot.build.variant_system_lib=
GEVINO_SAM-BA_boot.build.vid=0x2341
GEVINO_SAM-BA_boot.build.pid=0x804d
GEVINO_SAM-BA_boot.bootloader.tool=openocd
GEVINO_SAM-BA_boot.bootloader.tool.default=openocd
GEVINO_SAM-BA_boot.bootloader.file=zero/samd21_sam_ba.bin

# GEVINO_SD_boot
# --------------------------------------
GEVINO_SD_boot.name=GEVINO SD Boot
GEVINO_SD_boot.vid.0=0x2341
GEVINO_SD_boot.pid.0=0x804d
GEVINO_SD_boot.vid.1=0x2341
GEVINO_SD_boot.pid.1=0x004d
GEVINO_SD_boot.vid.2=0x2341
GEVINO_SD_boot.pid.2=0x824d
GEVINO_SD_boot.vid.3=0x2341
GEVINO_SD_boot.pid.3=0x024d
GEVINO_SD_boot.upload_port.0.vid=0x2341
GEVINO_SD_boot.upload_port.0.pid=0x804d
GEVINO_SD_boot.upload_port.1.vid=0x2341
GEVINO_SD_boot.upload_port.1.pid=0x004d
GEVINO_SD_boot.upload_port.2.vid=0x2341
GEVINO_SD_boot.upload_port.2.pid=0x824d
GEVINO_SD_boot.upload_port.3.vid=0x2341
GEVINO_SD_boot.upload_port.3.pid=0x024d
GEVINO_SD_boot.upload_port.4.board=GEVINO_SD_boot

GEVINO_SD_boot.upload.tool=bossac
GEVINO_SD_boot.upload.tool.default=bossac
GEVINO_SD_boot.upload.tool.network=arduino_ota
GEVINO_SD_boot.upload.protocol=sam-ba
GEVINO_SD_boot.upload.maximum_size=262144
GEVINO_SD_boot.upload.maximum_data_size=32768
GEVINO_SD_boot.upload.use_1200bps_touch=true
GEVINO_SD_boot.upload.wait_for_upload_port=true
GEVINO_SD_boot.upload.native_usb=true
GEVINO_SD_boot.build.mcu=cortex-m0plus
GEVINO_SD_boot.build.f_cpu=48000000L
GEVINO_SD_boot.build.usb_product="GEVINO"
GEVINO_SD_boot.build.usb_manufacturer="GEVA elettronica"
GEVINO_SD_boot.build.board=GEVINO
GEVINO_SD_boot.build.core=arduino
GEVINO_SD_boot.build.extra_flags=-D__SAMD21G18A__ {build.usb_flags}
GEVINO_SD_boot.build.ldscript=linker_scripts/gcc/flash_with_SDbootloader.ld
GEVINO_SD_boot.build.openocdscript=openocd_scripts/arduino_zero.cfg
GEVINO_SD_boot.build.variant=arduino_zero
GEVINO_SD_boot.build.variant_system_lib=
GEVINO_SD_boot.build.vid=0x2341
GEVINO_SD_boot.build.pid=0x804d
GEVINO_SD_boot.bootloader.tool=openocd
GEVINO_SD_boot.bootloader.tool.default=openocd
GEVINO_SD_boot.bootloader.file=zero/samd21_sam_ba.bin


# GEVINO_NO_boot
# --------------------------------------
GEVINO_NO_boot.name=GEVINO NO Boot
GEVINO_NO_boot.vid.0=0x2341
GEVINO_NO_boot.pid.0=0x804d
GEVINO_NO_boot.vid.1=0x2341
GEVINO_NO_boot.pid.1=0x004d
GEVINO_NO_boot.vid.2=0x2341
GEVINO_NO_boot.pid.2=0x824d
GEVINO_NO_boot.vid.3=0x2341
GEVINO_NO_boot.pid.3=0x024d
GEVINO_NO_boot.upload_port.0.vid=0x2341
GEVINO_NO_boot.upload_port.0.pid=0x804d
GEVINO_NO_boot.upload_port.1.vid=0x2341
GEVINO_NO_boot.upload_port.1.pid=0x004d
GEVINO_NO_boot.upload_port.2.vid=0x2341
GEVINO_NO_boot.upload_port.2.pid=0x824d
GEVINO_NO_boot.upload_port.3.vid=0x2341
GEVINO_NO_boot.upload_port.3.pid=0x024d
GEVINO_NO_boot.upload_port.4.board=GEVINO_NO_boot

GEVINO_NO_boot.upload.tool=bossac
GEVINO_NO_boot.upload.tool.default=bossac
GEVINO_NO_boot.upload.tool.network=arduino_ota
GEVINO_NO_boot.upload.protocol=sam-ba
GEVINO_NO_boot.upload.maximum_size=262144
GEVINO_NO_boot.upload.maximum_data_size=32768
GEVINO_NO_boot.upload.use_1200bps_touch=true
GEVINO_NO_boot.upload.wait_for_upload_port=true
GEVINO_NO_boot.upload.native_usb=true
GEVINO_NO_boot.build.mcu=cortex-m0plus
GEVINO_NO_boot.build.f_cpu=48000000L
GEVINO_NO_boot.build.usb_product="GEVINO"
GEVINO_NO_boot.build.usb_manufacturer="GEVA elettronica"
GEVINO_NO_boot.build.board=GEVINO
GEVINO_NO_boot.build.core=arduino
GEVINO_NO_boot.build.extra_flags=-D__SAMD21G18A__ {build.usb_flags}
GEVINO_NO_boot.build.ldscript=linker_scripts/gcc/flash_without_bootloader.ld
GEVINO_NO_boot.build.openocdscript=openocd_scripts/arduino_zero.cfg
GEVINO_NO_boot.build.variant=arduino_zero
GEVINO_NO_boot.build.variant_system_lib=
GEVINO_NO_boot.build.vid=0x2341
GEVINO_NO_boot.build.pid=0x804d
GEVINO_NO_boot.bootloader.tool=openocd
GEVINO_NO_boot.bootloader.tool.default=openocd
GEVINO_NO_boot.bootloader.file=zero/samd21_sam_ba.bin

# Arduino Zero (Prorgamming Port)
# ---------------------------------------
arduino_zero_edbg.name=Arduino Zero (Programming Port)
arduino_zero_edbg.vid.0=0x03eb
arduino_zero_edbg.pid.0=0x2157
arduino_zero_edbg.upload_port.0.vid=0x03eb
arduino_zero_edbg.upload_port.0.pid=0x2157
arduino_zero_edbg.upload_port.1.board=arduino_zero_edbg

arduino_zero_edbg.upload.tool=openocd
arduino_zero_edbg.upload.tool.default=openocd
arduino_zero_edbg.upload.tool.network=arduino_ota
arduino_zero_edbg.upload.protocol=sam-ba
arduino_zero_edbg.upload.maximum_size=262144
arduino_zero_edbg.upload.maximum_data_size=32768
arduino_zero_edbg.upload.use_1200bps_touch=false
arduino_zero_edbg.upload.wait_for_upload_port=false
arduino_zero_edbg.upload.native_usb=false
arduino_zero_edbg.build.mcu=cortex-m0plus
arduino_zero_edbg.build.f_cpu=48000000L
arduino_zero_edbg.build.usb_product="Arduino Zero"
arduino_zero_edbg.build.usb_manufacturer="Arduino LLC"
arduino_zero_edbg.build.board=SAMD_ZERO
arduino_zero_edbg.build.core=arduino
arduino_zero_edbg.build.extra_flags=-D__SAMD21G18A__ {build.usb_flags}
arduino_zero_edbg.build.ldscript=linker_scripts/gcc/flash_with_bootloader.ld
arduino_zero_edbg.build.openocdscript=openocd_scripts/arduino_zero.cfg
arduino_zero_edbg.build.variant=arduino_zero
arduino_zero_edbg.build.variant_system_lib=
arduino_zero_edbg.build.vid=0x2341
arduino_zero_edbg.build.pid=0x804d
arduino_zero_edbg.bootloader.tool=openocd
arduino_zero_edbg.bootloader.tool.default=openocd
arduino_zero_edbg.bootloader.file=zero/samd21_sam_ba.bin

